---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalSupportCycleWarning
source: html/05fdd2a8-00a5-af99-c20c-8001bb603304.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AnalyticalSupportCycleWarning Property

Circular support chain detected

## Syntax (C#)
```csharp
public static FailureDefinitionId AnalyticalSupportCycleWarning { get; }
```